Ran Plan for 4 projects:

1. dir: `deployment/all-gcp` workspace: `default`
1. dir: `deployment/service/ols-svc-profile` workspace: `default`
1. dir: `deployment/service/ols-svc-talkgpt` workspace: `default`
1. dir: `deployment/service/ols-svc-transribegpt` workspace: `default`

### 1. dir: `deployment/all-gcp` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.gce-atlantis.local_file.ansible_vars[0] will be created
+ resource "local_file" "ansible_vars" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "atlantis/ansible_vars.json"
      + id                   = (known after apply)
    }

  # module.gce-atlantis.local_file.private_key will be created
+ resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0400"
      + filename             = "atlantis/id_rsa.pem"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d deployment/all-gcp`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-compute-atlantis:4141/lock?id=blastcoid%252Fols_iac%252Fdeployment%252Fall-gcp%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d deployment/all-gcp`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `deployment/service/ols-svc-profile` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #3. To continue, delete the lock from #3 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 3. dir: `deployment/service/ols-svc-talkgpt` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.argocd_app.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ols-talkgpt"
      + namespace                  = "cd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (sensitive value)
      + verify                     = false
      + version                    = "1.4.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.workload_identity.google_project_iam_member.sa_iam must be replaced
-/+ resource "google_project_iam_member" "sa_iam" {
      ~ etag    = "BwYEn3HKRf0=" -> (known after apply)
      ~ id      = "ols-platform-dev/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceAccount:ols-svc-talkgpt@ols-platform-dev.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/cloudkms.cryptoKeyEncrypterDecrypter" -> "roles/speech.admin" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d deployment/service/ols-svc-talkgpt`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-compute-atlantis:4141/lock?id=blastcoid%252Fols_iac%252Fdeployment%252Fservice%252Fols-svc-talkgpt%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d deployment/service/ols-svc-talkgpt`
</details>
Plan: 2 to add, 0 to change, 1 to destroy.

---
### 4. dir: `deployment/service/ols-svc-transribegpt` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.argocd_app.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ols-transcribegpt"
      + namespace                  = "cd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (sensitive value)
      + verify                     = false
      + version                    = "1.4.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.workload_identity.google_project_iam_member.sa_iam will be created
+ resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ols-platform-dev"
      + role    = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.workload_identity.google_service_account.gsa will be created
+ resource "google_service_account" "gsa" {
      + account_id   = "ols-svc-transcribegpt"
      + disabled     = false
      + display_name = "Service Account for ols-svc-transcribegpt service"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "ols-platform-dev"
      + unique_id    = (known after apply)
    }

  # module.workload_identity.google_service_account_iam_binding.workload_identity_binding will be created
+ resource "google_service_account_iam_binding" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:ols-platform-dev.svc.id.goog[dev/ols-svc-transcribegpt]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d deployment/service/ols-svc-transribegpt`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-compute-atlantis:4141/lock?id=blastcoid%252Fols_iac%252Fdeployment%252Fservice%252Fols-svc-transribegpt%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d deployment/service/ols-svc-transribegpt`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`